Revit 2026 API

# ZoneEquipmentBehavior Enumeration

---

The behavior of zone equipment associated with spaces.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ZoneEquipmentBehavior
```
```vb
Public Enumeration ZoneEquipmentBehavior
```
```cpp
public enum class ZoneEquipmentBehavior
```
```fsharp
type ZoneEquipmentBehavior
```

| Member name | Value | Description |
| --- | --- | --- |
| GroupSpaces | 1 |  |
| OnePerSpace | 0 |  |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace